ici-test-automation-feature-environment-readiness/ic-integration-tests/src/test/resources/psrm/receiveHoering/EnvelopeTemplate.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ns="http://skat.dk/begrebsmodel/2009/01/15/">
    <soap:Header/>
    <soap:Body>
        <ns:PSRMOpretHoeringSag_I>
            <ns:Kontekst>
            </ns:Kontekst>
            <ns:MFKundeStruktur>
                <ns:Valg>
                    <ns:VirksomhedSENummer>1001</ns:VirksomhedSENummer>
                    <ns:PersonCPRNummer>1002</ns:PersonCPRNummer>
                    <ns:AlternativKontaktID>1003</ns:AlternativKontaktID>
                    <ns:EFIAlternativKontaktStruktur>
                        <ns:AlternativKontaktNavn>1004</ns:AlternativKontaktNavn>
                        <ns:AlternativKontaktType>1005</ns:AlternativKontaktType>
                        <ns:Nationalitet>
                            <ns:LandKode>1006</ns:LandKode>
                        </ns:Nationalitet>
                        <ns:AlternativKontaktBemærkning>1007</ns:AlternativKontaktBemærkning>
                        <ns:AlternativKontaktHenvisningNummer>
                            <ns:AlternativKontaktID>1008</ns:AlternativKontaktID>
                        </ns:AlternativKontaktHenvisningNummer>
                        <ns:PersonOplysninger>
                            <ns:CivilstandKode>1009</ns:CivilstandKode>
                            <ns:AlternativKontaktPersonFødselDato>2017-01-01</ns:AlternativKontaktPersonFødselDato>
                            <ns:AlternativKontaktPersonKøn>1010</ns:AlternativKontaktPersonKøn>
                            <ns:AlternativKontaktPersonNavnAdresseBeskyttelseMarkering>1011</ns:AlternativKontaktPersonNavnAdresseBeskyttelseMarkering>
                            <ns:PersonStatusDødsfaldDato>2017-01-01</ns:PersonStatusDødsfaldDato>
                        </ns:PersonOplysninger>
                        <ns:AlternativKontaktReferenceStrukturListe>
                            <ns:AlternativKontaktReferenceStruktur>
                                <ns:AlternativKontaktReferenceType>1012</ns:AlternativKontaktReferenceType>
                                <ns:AlternativKontaktReferenceTekst>1013</ns:AlternativKontaktReferenceTekst>
                                <ns:LandKode>1014</ns:LandKode>
                            </ns:AlternativKontaktReferenceStruktur>
                        </ns:AlternativKontaktReferenceStrukturListe>
                        <ns:EmailListe>
                            <ns:Email>
                                <ns:EmailAdresseEmail>test@email.dk</ns:EmailAdresseEmail>
                                <ns:AlternativEmailForholdPrimærMarkering>1015</ns:AlternativEmailForholdPrimærMarkering>
                            </ns:Email>
                        </ns:EmailListe>
                        <ns:TelefonListe>
                            <ns:Telefon>
                                <ns:TelefonUdenlandskNummer>1016</ns:TelefonUdenlandskNummer>
                                <ns:AlternativTelefonForholdPrimærMarkering>1017</ns:AlternativTelefonForholdPrimærMarkering>
                            </ns:Telefon>
                        </ns:TelefonListe>
                        <ns:FaxListe>
                            <ns:Fax>
                                <ns:FaxUdlandNummer>1018</ns:FaxUdlandNummer>
                                <ns:AlternativFaxForholdPrimærMarkering>1019</ns:AlternativFaxForholdPrimærMarkering>
                            </ns:Fax>
                        </ns:FaxListe>
                        <ns:Adresse>
                            <ns:AlternativAdresseAdresseLinie1>1020</ns:AlternativAdresseAdresseLinie1>
                            <ns:AlternativAdresseAdresseLinie2>1021</ns:AlternativAdresseAdresseLinie2>
                            <ns:AlternativAdresseAdresseLinie3>1022</ns:AlternativAdresseAdresseLinie3>
                            <ns:AlternativAdresseAdresseLinie4>1023</ns:AlternativAdresseAdresseLinie4>
                            <ns:AlternativAdresseAdresseLinie5>1024</ns:AlternativAdresseAdresseLinie5>
                            <ns:AlternativAdresseAdresseLinie6>1025</ns:AlternativAdresseAdresseLinie6>
                            <ns:AlternativAdresseAdresseLinie7>1026</ns:AlternativAdresseAdresseLinie7>
                            <ns:LandKode>1027</ns:LandKode>
                        </ns:Adresse>
                    </ns:EFIAlternativKontaktStruktur>
                </ns:Valg>
            </ns:MFKundeStruktur>
            <ns:DMIFordringHaverID>1028</ns:DMIFordringHaverID>
            <ns:DMIFordringHaverNavn>1029</ns:DMIFordringHaverNavn>
            <ns:DMIFordringEFIFordringID>1030</ns:DMIFordringEFIFordringID>
            <ns:MFAktionID>{{ACTION_ID}}</ns:MFAktionID>
            <ns:MFAktionKode>{{ACTION_CODE}}</ns:MFAktionKode>
            <ns:DMIFordringFordringArtKode>1031</ns:DMIFordringFordringArtKode>
            <ns:DMIFordringTypeKode>1032</ns:DMIFordringTypeKode>
            <ns:DMIFordringModtagelseDato>2017-01-01</ns:DMIFordringModtagelseDato>
            <ns:DMIFordringEFIHovedFordringID>1033</ns:DMIFordringEFIHovedFordringID>
            <ns:HoeringsGrundlag>
                <ns:DokumentFilType>1034</ns:DokumentFilType>
                <ns:DokumentFilIndhold>cid:197766425427</ns:DokumentFilIndhold>
            </ns:HoeringsGrundlag>
            <ns:DokumentSamling>
                <ns:MFDokumentStruktur>
                    <ns:DPDokumentArt>1035</ns:DPDokumentArt>
                    <ns:DokumentFormatValg>
                        <ns:DokumentFil>
                            <ns:DokumentFilType>1036</ns:DokumentFilType>
                            <ns:DokumentFilIndhold>cid:1123464237714</ns:DokumentFilIndhold>
                        </ns:DokumentFil>
                    </ns:DokumentFormatValg>
                </ns:MFDokumentStruktur>
            </ns:DokumentSamling>
        </ns:PSRMOpretHoeringSag_I>
    </soap:Body>
</soap:Envelope>